frontend/controllers/SiteController.php

SELECT * FROM `hero_person`
SELECT * FROM `war_map_location`
---
    public function actionIndex()
    {
        // 1. 获取所有英雄数据
        $heroes = HeroPerson::find()->all();

        // 2. 获取所有地标数据 (新增代码)
        $locations = WarMapLocation::find()->all();